
class txt(object):
    STAT = """Hello {} 👋🏻
I'am A Multi use Bot with many usefull features.
Eg:- Telegarph, Channel ID, Image editor etc... """

    ABT = """ 
╔════❰ ᴍᴜʟᴛɪ ᴜsᴀɢᴇ ❱═❍
║╭━━━━━━━━━━━━━━━➣
║┣⪼🤖 ᴍʏ ɴᴀᴍᴇ : {bot}
║┣⪼👦 ᴄʀᴇᴀᴛᴏʀ : <a href=https://t.me/MLZ_BOTZ>ᴛᴇᴀᴍ ᴍʟᴢ</a>
║┣⪼👨‍💻 ᴅᴇᴠ : <a href=https://t.me/AJAYxTG>ᴀᴊᴀʏ ᠰ ᴛɢ</a>
║┣⪼🗣️ ʟᴀɴɢᴜᴀɢᴇ : <a href=https://www.python.org>ᴘʏᴛʜᴏɴ 3</a>
║┣⪼📚 ʟɪʙʀᴀʀʏ : <a href=https://github.com/pyrogram>ᴘʏʀᴏɢʀᴀᴍ</a> 
║┣⪼🗒️ ᴠᴇʀsɪᴏɴ : ᴠ3.0.1 
║╰━━━━━━━━━━━━━━━➣
╚══════════════════❍ """

    HELP = """ʜᴇʀᴇ ɪs ᴍʏ ʜᴇʟᴘ ᴄᴏᴍᴍᴀɴᴅs"""

    SOURCE = """ʙʏ ᴛᴇᴀᴍ ᴍʟᴢ ʙᴏᴛᴢ"""

    INFO = """ᴊᴜsᴛ sᴇɴᴅ /id ᴏʀ ɪɴғᴏ ᴛᴏ ɢᴇᴛ ʏᴏᴜʀ ᴛɢ ɪᴅ & ɪɴғᴏ 🍁

/id ᴏʀ /info ʀᴇᴘʟʏ ᴛᴏ ᴀɴʏ ᴍᴇᴅɪᴀ ᴛᴏ ɢᴇᴛ ᴍᴇᴅɪᴀ ɪᴅ

sᴇɴᴅ ᴄʜᴀɴɴᴇʟ ʟᴀsᴛ ᴍᴇssᴀɢᴇ ᴡɪᴛʜ ғᴏʀᴡᴇʀᴅ ᴛᴀɢ ᴛᴏ ɢᴇᴛ ᴛʜᴇ ᴄʜᴀɴɴᴇʟ ɪᴅ """

    WRITE = """ <b>ʜᴇʟᴩ: ᴡʀɪᴛᴇ</b>
ʙʏ ᴜꜱɪɴɢ ᴛʜɪꜱ ᴄᴏᴍᴍᴀɴᴅ ʏᴏᴜ ᴄᴀɴ ᴡʀɪᴛᴇ ʏᴏᴜʀ ᴀꜱꜱᴀɪɢɴᴍᴇɴᴛ ᴡɪᴛʜᴏᴜᴛᴛ ᴡʀɪᴛᴇɪɴɢ ɪᴛ ᴏɴ ɴᴏᴛᴇ ʙᴏᴏᴋ 

<b>ᴄᴏᴍᴍᴀɴᴅꜱ ᴀɴᴅ ᴜꜱᴀɢᴇ:</b>
• /write - <code>ᴛᴏ ᴡʀɪᴛᴇ ᴀꜱꜱᴀɪɢɴᴍᴇɴᴛ</code>"""

    REPO = """<b>ʜᴇʟᴩ: ʀᴇᴩᴏ</b>
ʙʏ ᴜꜱɪɴɢ ᴛʜɪꜱ ꜰᴇᴀᴛᴜʀᴇ ʏᴏᴜ ᴄᴀɴ ꜰɪɴᴅ ᴡᴏʀᴋɪɴɢ ɢɪᴛʜᴜʙ ʙᴏᴛ ʀᴇᴩᴏꜱ

<b>ᴄᴏᴍᴍᴀɴᴅꜱ ᴀɴᴅ ᴜꜱᴀɢᴇ:</b>
• /repo reponame - <code>ᴛʏᴩᴇ ʟɪᴋᴇ ᴛʜɪꜱ ᴀɴᴅ ꜱᴇɴᴅ ᴛᴏ ɢᴇᴛ ʀᴇᴩᴏ</code>"""

    SONG = """<b>ʜᴇʟᴩ: ꜱᴏɴɢ</b>

ꜱᴏɴɢ ᴅᴏᴡɴʟᴏᴀᴅ ᴍᴏᴅᴜʟᴇ, ꜰᴏʀ ᴛʜᴏꜱᴇ ᴡʜᴏ ʟᴏᴠᴇ ᴍᴜꜱɪᴄ. ʏᴏᴜ ᴄᴀɴ ᴜꜱᴇ ᴛʜɪꜱ ꜰᴇᴀᴛᴜʀᴇ ꜰᴏʀ ᴅᴏᴡɴʟᴏᴀᴅ ᴀɴʏ ꜱᴏɴɢ ʙʏ ᴜꜱɪɴɢ ᴛʜɪꜱ ʙᴏᴛ

<b>ᴄᴏᴍᴍᴀɴᴅ ᴀɴᴅ ᴜꜱᴀɢᴇ:</b> 
• /song ꜱᴏɴɢ ɴᴀᴍᴇ - <code>ᴛʏᴩᴇ ʟɪᴋᴇ ᴛʜɪꜱ ᴀɴᴅ ꜱᴇɴᴅ ᴛᴏ ɢᴇᴛ ꜱᴏɴɢ</code>"""
    
    CHANNEL_ID = "--"

    LYRICS = """<b>ʜᴇʟᴩ: ʟʏʀɪᴄꜱ</b>
ᴛʜɪꜱ ꜰᴇᴀᴛᴜʀᴇ ʜᴇʟᴩꜱ ʏᴏᴜ ᴛᴏ ꜰɪɴᴅ ꜱᴏɴɢꜱ ʟʏʀɪᴄꜱ

<b>ᴄᴏᴍᴍᴀɴᴅꜱ ᴀɴᴅ ᴜꜱᴀɢᴇ:</b>
• /lyrics - <code>ʀᴇᴩʟʏ ᴛʜɪꜱ ᴄᴏᴍᴍᴀɴᴅ ᴛᴏ ᴀɴʏ ꜱᴏɴɢ ɴᴀᴍᴇ</code>"""

    URL = """<b>ʜᴇʟᴩ: ᴜʀʟ ꜱʜᴏʀᴛ</b>
ᴛʜɪꜱ ᴄᴏᴍᴍᴀɴꜱ ʜᴇʟᴩꜱ ʏᴏᴜ ᴛᴏ ꜱʜᴏʀᴛ ᴀ ᴜʀʟ

<b>ᴄᴏᴍᴍᴀɴᴅꜱ ᴀɴᴅ ᴜꜱᴀɢᴇ:</b>:
• /short - <code>ᴜꜱᴇ ᴛʜɪꜱ ᴄᴏᴍᴍᴀᴍᴅ ᴡɪᴛʜ ʏᴏᴜʀ ʟɪɴᴋ ᴛᴏ ɢᴇᴛ ꜱʜᴏʀᴛᴇᴅ ʟɪɴᴋ</code>"""
    
    TELE = """<b>ʜᴇʟᴩ: ᴛᴇʟᴇɢʀᴀᴩʜ</b>
     
ᴅᴏ ᴀꜱ ʏᴏᴜ ᴡɪꜱʜ ᴡɪᴛʜ graph.org ᴍᴏᴅᴜʟᴇ

</b>ᴄᴏᴍᴍᴀɴᴅꜱ ᴀɴᴅ ᴜꜱᴀɢᴇ:</b> 
• /telegraph - ꜱᴇɴᴅ ᴍᴇ ᴛʜɪꜱ ᴄᴏᴍᴍᴀɴᴅ ʀᴇᴩʟʏ ᴡɪᴛʜ ᴀ ᴩɪᴄᴛᴜʀᴇ  ᴏʀ ᴠɪᴅᴇᴏ ᴜɴᴅᴇʀ 𝟻ᴍʙ"""

    IMAGE = """ʜᴇʟᴘ: ɪᴍᴀɢᴇ

ᴛʜɪs ᴄᴏᴍᴍᴀɴᴅ ʜᴇʟᴘs ʏᴏᴜ ᴛᴏ ᴇᴅɪᴛ ɪᴍᴀɢᴇ ᴠᴇʀʏ ᴇᴀsɪʟʏ

ᴄᴏᴍᴍᴀɴᴅs ᴀɴᴅ ᴜsᴀɢᴇ
ᴊᴜsᴛ sᴇɴᴅ ᴀ ɪᴍᴀɢᴇ ᴛᴏ ᴇᴅɪᴛ """
  
    STICKER = """ʜᴇʟᴘ: sɪᴛɪᴄᴋᴇʀ
    
ᴄᴏɴᴠᴇʀᴛ sᴛɪᴄᴋᴇʀ ᴛᴏ ᴘʜᴏᴛᴏ. ᴄʀᴇᴀᴛᴇ sᴛɪᴄᴋᴇʀ ᴘᴀᴄᴋ. ғɪɴᴅ sᴛɪᴄᴋᴇʀ ɪᴅ

ᴄᴏᴍᴍᴀɴᴅs ᴀɴᴅ ᴜsᴀɢᴇ
◉ /s2_photo - ʀᴇᴘʟʏ ᴛᴏ ᴀɴʏ sᴛɪᴄᴋᴇʀ
◉ /kang - ʀᴇᴘʟʏ ᴛᴏ sᴛɪᴄᴋᴇʀ ᴏʀ ᴘɴɢ ғɪʟᴇ ᴛᴏ ᴘᴀᴄᴋ sᴛɪᴄᴋᴇʀ
◉ /id or /info - ʀᴇᴘʟʏ ᴛᴏ ᴀɴʏ ᴀɴʏ sᴛɪᴄᴋᴇʀ"""
   
    CARB_TXT = """<b>ʜᴇʟᴩ: ᴄᴀʀʙᴏɴ</b>
ᴄᴀʀʙᴏɴ ɪꜱ ᴀ ꜰᴇᴀᴛᴜʀᴇ ᴛᴏ ᴍᴀᴋᴇ ᴛʜᴇ ɪᴍᴀɢᴇ ᴀꜱ ꜱʜᴏᴡɴ ɪɴ ᴛʜᴇ ᴛᴏᴩ ᴡɪᴛʜ ʏᴏᴜʀ ᴛᴇxᴛꜱ

<b>ᴄᴏᴍᴍᴀɴᴅꜱ ᴀɴᴅ ᴜꜱᴀɢᴇ:</b>
• /carbon - <code>ꜰᴏʀ ᴜꜱɪɴɢ ᴛʜɪꜱ ᴄᴏᴍᴍᴀɴᴅ ʀᴇᴩʟʏ ᴀ ᴛᴇxᴛ ᴡɪᴛʜ ᴛʜɪꜱ ᴄᴏᴍᴍᴀɴᴅ</code>"""
    
    LOGO = """ᴛᴏ ᴍᴀᴋᴇ ʟᴏɢᴏ - /logo ʏᴏᴜʀ ɴᴀᴍᴇ
ᴛᴏ ᴍᴀᴋᴇ sǫᴜᴀʀᴇ ʟᴏɢᴏ  /logosq ʏᴏᴜʀ ɴᴀᴍᴇ

ᴇxᴀᴍᴘʟᴇ
/logo MLZ
/logosq Ajay  """

    YTDL = """ʜᴇʟᴘ: ʏᴛ ᴅʟ

ʏᴏᴜ ᴄᴀɴ ᴅᴏᴡɴʟᴏᴀᴅ ʏᴏᴜᴛᴜʙᴇ ᴠɪᴅᴇᴏ ᴜsɪɴɢ ɪs ғᴇᴀᴛᴜʀᴇ

ᴄᴏᴍᴍᴀɴᴅs ᴀɴᴅ ᴜsᴀɢᴇ
/video ᴏʀ /mp4 ᴀɴᴅ https://youtu.be/*****
ᴇxᴀᴍᴘʟᴇ:
<code>/mp4 https://youtu.be/*******</code>
<code>/video https://youtu.be/*****</code>  """
  
    FONT = """<b>ʜᴇʟᴩ: ꜰᴏɴᴛ</b>
ꜰᴏɴᴛ ɪꜱ ᴀ ᴍᴏᴅᴜʟᴇ ꜰᴏʀ ᴍᴀᴋᴇ ʏᴏᴜʀ ᴛᴇxᴛ ꜱᴛʏʟɪꜱʜ
ꜰᴏʀ ᴜꜱᴇ ᴛʜᴀᴛ ꜰᴇᴀᴛᴜʀᴇ ᴛʏᴩᴇ /font <your text> ᴛʜᴇɴ ʏᴏᴜʀ ᴛᴇxᴛ ʀᴇᴀᴅʏ"""
    
    TTS = """Help: <b> TTS 🎤 module:</b>

Translate text to speech

<b>Commands and Usage:</b>

• /tts <text> : convert text to speech

<b>NOTE:</b>
• These commands works on both pm and group.
• this can translate texts to 200+ languages."""


    INFO_TXT = """<i>
<u>👁️‍🗨️YOUR DETAILS</u>

○ ID : <code>{id}</code>
○ DC : <code>{dc}</code>
○ First Name : <code>{n}<code>
○ UserName : @{u}
○ link : <code>https://t.me/{u}</code>

Thank You For Using Me❣️</i>"""
